AccumulationRegisters/Игры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Игры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выигр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ничьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пораж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПОчки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГдеИгра</Name>
					<Comment>1 - дома 2 - выезд</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/омВызовСервера/Ext/Module.bsl
Функция обПолучитьТекущийСезонСервер() Экспорт
	
	Возврат Константы.ТекущийСезон.Получить()
	
КонецФункции // обЧислоВСчет()

Функция обИнфоСервер(Хозяин, Гость, Сыгран, стрЗаголовок) Экспорт 
	
	ТабДокР = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("ИнфоОбщийМакет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИгрыОбороты.Сезон КАК Сезон,
	               |	ИгрыОбороты.Тур КАК Тур,
	               |	ИгрыОбороты.Дата КАК Дата,
	               |	ВЫБОР
	               |		КОГДА ИгрыОбороты.ГдеИгра = 1
	               |			ТОГДА ""Д""
	               |		ИНАЧЕ ""В""
	               |	КОНЕЦ КАК ГдеИгра,
	               |	ИгрыОбороты.СчетОборот КАК СчетОборот,
	               |	ИгрыОбороты.ВыигрОборот КАК Выигр,
	               |	ИгрыОбороты.НичьиОборот КАК Ничья,
	               |	ИгрыОбороты.ПоражОборот КАК Пораж,
	               |	ИгрыОбороты.МЗОборот КАК МЗОборот,
	               |	ИгрыОбороты.МПОборот КАК МПОборот,
	               |	ИгрыОбороты.ОчкиОборот,
	               |	ИгрыОбороты.ПОчкиОборот
	               |ИЗ
	               |	РегистрНакопления.Игры.Обороты(
	               |			,
	               |			,
	               |			,
	               |			Кто = &Команда
	               |				И СКем = &Соперник) КАК ИгрыОбороты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(Тур),
	               |	СУММА(Выигр),
	               |	СУММА(Ничья),
	               |	СУММА(Пораж),
	               |	СУММА(МЗОборот),
	               |	СУММА(МПОборот)
	               |ПО
	               |	ОБЩИЕ,
	               |	Сезон";
				   
				   
	Запрос.УстановитьПараметр("Команда", Хозяин);
	Запрос.УстановитьПараметр("Соперник", Гость);
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	ОбластьИтог		= Макет.ПолучитьОбласть("Итог");
	ОбластьМеста	= Макет.ПолучитьОбласть("Места");
	ОбластьСтрока5	= Макет.ПолучитьОбласть("СтрокаПоследние5");
	ОбластьПрогноз	= Макет.ПолучитьОбласть("СтрокаПрогноз");
	ОбластьТекст5	= Макет.ПолучитьОбласть("ТекстПоследние5");
	ОблПустСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	облГдеИгра = ОбластьСтрока.Область("облГдеИгра");
	облСчет		= ОбластьСтрока.Область("облСчет");
	
	ЦветПобеда	= WebЦвета.Красный;
	ЦветНичьи	= WebЦвета.Зеленый;
	ЦветПораж	= WebЦвета.СветлоГрифельноСиний;

	ТабДокР.Вывести(ОбластьШапка);
	ТабДокР.Вывести(ОблПустСтрока);
	
	// итоги
	таблМестаИт	= обПолучитьТекущиеМестаКоманд(1);	// итоговое
	
	// сезон
	ОбластьМеста.Параметры.текстСобытия = "сезон";
	стр = таблМестаИт.Найти(Хозяин, "Кто");
	Место1И = таблМестаИт.Индекс(стр) + 1;
	ОбластьМеста.Параметры.Текст1 = ""+стр.Выигр+"-"+стр.Ничьи+"-"+стр.Пораж+" "+стр.МЗ+"-"+стр.МП;
	
	стр = таблМестаИт.Найти(Гость, "Кто");
	Место2И = таблМестаИт.Индекс(стр) + 1;
	ОбластьМеста.Параметры.Текст2 = ""+стр.Выигр+"-"+стр.Ничьи+"-"+стр.Пораж+" "+стр.МЗ+"-"+стр.МП;;
	ТабДокР.Вывести(ОбластьМеста);
	
	стрЗаголовок = "" + Хозяин+ " (" + Место1И + ") - " + Гость + " (" + Место2И + ")";
	
	// дома - выезд
	ОбластьМеста.Параметры.текстСобытия = "дома - выезд";
	таблМестаД	= обПолучитьТекущиеМестаКоманд(2);	// для Хозяин
	стр = таблМестаД.Найти(Хозяин, "Кто");
	МестоД = таблМестаД.Индекс(стр) + 1;
	Если стр.Игр > 0 Тогда
		Средний11 = стр.МЗ/стр.Игр;	Средний12 = стр.МП/стр.Игр;
		ОбластьМеста.Параметры.Текст1 = ""+стр.Выигр+"-"+стр.Ничьи+"-"+стр.Пораж+" "+стр.МЗ+"-"+стр.МП + "  " + Формат(Средний11,"ЧДЦ=2")+" за игру";
	КонецЕсли;
	
	таблМестаВ	= обПолучитьТекущиеМестаКоманд(3);	// для Гость
	стр = таблМестаВ.Найти(Гость, "Кто");
	МестоВ = таблМестаВ.Индекс(стр) + 1;
	Если стр.Игр > 0 Тогда
		Средний21 = стр.МЗ/стр.Игр; Средний22 = стр.МП/стр.Игр;
		ОбластьМеста.Параметры.Текст2 = ""+стр.Выигр+"-"+стр.Ничьи+"-"+стр.Пораж+" "+стр.МЗ+"-"+стр.МП  + "  " + Формат(Средний21,"ЧДЦ=2")+" за игру";
	КонецЕсли;
	ТабДокР.Вывести(ОбластьМеста);
	
	// last 5
	ТабДокР.Вывести(ОбластьТекст5);
	ТабДокР.Вывести(ОблПустСтрока);
	ВывестиСтроку(Хозяин, Гость,,, ОбластьСтрока5, ЦветПобеда, ЦветНичьи, ЦветПораж);
	ОбластьСтрока5.Параметры.текстСобытия = "("+Место1И+") все ("+Место2И+")";
	ТабДокР.Вывести(ОбластьСтрока5);
	ТабДокР.Вывести(ОблПустСтрока);
	
	ВывестиСтроку(Хозяин, Гость, Истина,, ОбластьСтрока5, ЦветПобеда, ЦветНичьи, ЦветПораж);
	ОбластьСтрока5.Параметры.текстСобытия = "("+МестоД+") дома - выезд ("+МестоВ+")";
	ТабДокР.Вывести(ОбластьСтрока5);
	ТабДокР.Вывести(ОблПустСтрока);
	
	ВывестиСтроку(Хозяин, Гость,, Истина, ОбластьСтрока5, ЦветПобеда, ЦветНичьи, ЦветПораж);
	ОбластьСтрока5.Параметры.текстСобытия = "между собой";
	ТабДокР.Вывести(ОбластьСтрока5);
	ТабДокР.Вывести(ОблПустСтрока);
	
	// прогноз
	Если Не Сыгран Тогда
		ОбластьПрогноз.Параметры.Текст1 = Формат(Средний11, "ЧДЦ=0");
		ОбластьПрогноз.Параметры.Текст2 = Формат(Средний21, "ЧДЦ=0");
		ТабДокР.Вывести(ОбластьПрогноз);
	КонецЕсли;	
	
	// история взаимоотношений
	Результат = Запрос.Выполнить();
	ТабДокР.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбщийИтог.Следующий();
	ОбластьИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	ТабДокР.Вывести(ОбластьИтог);
	
	ВыборкаСезон = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	Пока ВыборкаСезон.Следующий() Цикл
	
		Выборка = ВыборкаСезон.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ОбластьСтрока.Параметры.Счет = обЧислоВСчет(Выборка.СчетОборот);
			
			
			ГдеИгра = Выборка.ГдеИгра;
			
			облГдеИгра.ЦветТекста = ?(ГдеИгра="Д", WebЦвета.Оранжевый, WebЦвета.ЗеленыйЛес);
			
			Если Выборка.Выигр > 0 Тогда
				облСчет.ЦветТекста = ЦветПобеда;
			ИначеЕсли Выборка.Ничья > 0 Тогда
				облСчет.ЦветТекста = ЦветНичьи;
			Иначе
				облСчет.ЦветТекста = ЦветПораж;
			КонецЕсли;	
			
			ТабДокР.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ТабДокР.Вывести(ОблПустСтрока);
		
	КонецЦикла;
	
	ТабДокР.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДокР.ФиксацияСверху = ОбластьШапка.ВысотаТаблицы;
	
	Возврат ТабДокР;

КонецФункции //ОбработкаРасшифровкиСервер

Процедура ВывестиСтроку(Хозяин, Гость, ДВ = Ложь, МеждуСобой = Ложь, ОбластьСтрока5, ЦветПобеда, ЦветНичьи, ЦветПораж)
	
	Результат	= обПоследние5ИгрКоманды(Хозяин, ?(МеждуСобой, Гость, Неопределено), ?(ДВ, 1, 0));
	ВывестиПоследниеПять(Результат, ОбластьСтрока5, 1, ЦветПобеда, ЦветНичьи, ЦветПораж);
	
	Результат	= обПоследние5ИгрКоманды(Гость, ?(МеждуСобой, Хозяин, Неопределено), ?(ДВ, 2, 0));
	ВывестиПоследниеПять(Результат, ОбластьСтрока5, 2, ЦветПобеда, ЦветНичьи, ЦветПораж);

КонецПроцедуры

Процедура ВывестиПоследниеПять(Результат, ОбластьСтрока5, Половина, ЦветПобеда, ЦветНичьи, ЦветПораж)

	Выборка		= Результат.Выбрать();
	сч = 1;
	ИмяДВ = ?(Половина = 1, "Д", "В");
	
	Пока Выборка.Следующий() Цикл
		
		
		ОблДВ = ОбластьСтрока5.Область("R1C"+(8+сч*?(Половина=1, -1, 1)));
		ОблДВ.Примечание.Текст = "("+Выборка.Тур+" тур "+Формат(Выборка.Дата,"ДФ=dd.MM"+?(Выборка.Сезон=обПолучитьТекущийСезонСервер(),"",".yyyy"))
				+?(Выборка.Сезон=обПолучитьТекущийСезонСервер(),""," сез"+Выборка.Сезон.Код)+") "+Выборка.Соперник+" "+обЧислоВСчет(Выборка.СчетОборот) + " " + ?(Выборка.ГдеИгра = 1, "д", "в");

		Если Выборка.Выигр > 0 Тогда
			облДВ.ЦветТекста = ЦветПобеда;
			ОбластьСтрока5.Параметры[ИмяДВ+сч] = "В";
		ИначеЕсли Выборка.Ничья > 0 Тогда
			облДв.ЦветТекста = ЦветНичьи;
			ОбластьСтрока5.Параметры[ИмяДВ+сч] = "Н";
		Иначе
			облДВ.ЦветТекста = ЦветПораж;
			ОбластьСтрока5.Параметры[ИмяДВ+сч] = "П";
		КонецЕсли;	
		
		сч	= сч + 1;
		
	КонецЦикла;
	
	счч = сч;
	
	Для сч = счч По 5 Цикл
	
		ОблДВ = ОбластьСтрока5.Область("R1C"+(8+сч*?(Половина=1, 1, -1)));
		ОблДВ.Примечание.Текст = "";

		облДВ.ЦветТекста = Новый Цвет;
		ОбластьСтрока5.Параметры[ИмяДВ+сч] = "";
	
	КонецЦикла;
	

КонецПроцедуры
